app/controllers/apartamentos_controller.rb

SELECT "apartamentos".* FROM "apartamentos"
---
  def index
    @apartamentos = Apartamento.all

INSERT INTO "apartamentos" ("unidade", "ativo", "data_inclusao", "condominio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @apartamento = Apartamento.new(apartamento_params)
    @apartamento.ativo = true
    @apartamento.data_inclusao = DateTime.now

    respond_to do |format|
      if @apartamento.save

UPDATE "apartamentos" SET "data_alteracao" = ?, "unidade" = ?, "updated_at" = ? WHERE "apartamentos"."id" = ?  [["data_alteracao", "2018-06-04 13:27:51.579884"], ["unidade", "ssss"], ["updated_at", "2018-06-04 13:27:51.582127"], ["id", 9]]
---
  def update
    @apartamento.data_alteracao = DateTime.now
    respond_to do |format|
      if @apartamento.update(apartamento_params)

UPDATE "apartamentos" SET "ativo" = ?, "data_alteracao" = ?, "updated_at" = ? WHERE "apartamentos"."id" = ?  [["ativo", "f"], ["data_alteracao", "2018-06-04 13:27:59.265459"], ["updated_at", "2018-06-04 13:27:59.268150"], ["id", 9]]
---
  def destroy
    #@apartamento.destroy
    @apartamento.ativo = !@apartamento.ativo
    @apartamento.data_alteracao = DateTime.now
    respond_to do |format|
      if @apartamento.update(@apartamento.attributes)

SELECT  "apartamentos".* FROM "apartamentos" WHERE "apartamentos"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_apartamento
      @apartamento = Apartamento.find(params[:id])