app/controllers/condominios_controller.rb

  def index
    @condominios = Condominio.all
---
SELECT "condominios".* FROM "condominios"

  def create
    @condominio = Condominio.new(condominio_params)

    respond_to do |format|
      if @condominio.save
---
INSERT INTO "condominios" ("saldo", "fundo_reserva", "created_at", "updated_at", "nome") VALUES (?, ?, ?, ?, ?)  [["saldo", 200.0], ["fundo_reserva", 200.0], ["created_at", "2018-04-19 00:19:30.864281"], ["updated_at", "2018-04-19 00:19:30.864281"], ["nome", "Thiago Cond"]]

    def set_condominio
      @condominio = Condominio.find(params[:id])
---
SELECT  "condominios".* FROM "condominios" WHERE "condominios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]