app/controllers/descricao_tipos_controller.rb

SELECT "descricao_tipos".* FROM "descricao_tipos"
---
  def index
    @descricao_tipos = DescricaoTipo.all

INSERT INTO "descricao_tipos" ("nome", "natureza", "valor_fixo", "ativo", "data_inclusao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @descricao_tipo = DescricaoTipo.new(descricao_tipo_params)
    @descricao_tipo.ativo = true
    @descricao_tipo.data_inclusao = DateTime.now

    respond_to do |format|
      if @descricao_tipo.save

UPDATE "descricao_tipos" SET "data_alteracao" = ?, "nome" = ?, "updated_at" = ? WHERE "descricao_tipos"."id" = ?  [["data_alteracao", "2018-05-08 14:39:23.153171"], ["nome", "Teste"], ["updated_at", "2018-05-08 14:39:23.154891"], ["id", 4]]
---
  def update
    @descricao_tipo.data_alteracao = DateTime.now
    respond_to do |format|
      if @descricao_tipo.update(descricao_tipo_params)

SELECT  "descricao_tipos".* FROM "descricao_tipos" WHERE "descricao_tipos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_descricao_tipo
      @descricao_tipo = DescricaoTipo.find(params[:id])