app/controllers/despesas_controller.rb

SELECT "despesas".* FROM "despesas"
---
  def index
    @despesas = Despesa.all

INSERT INTO "despesas" ("data", "valor", "natureza", "ativo", "data_inclusao", "descricao_tipo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @despesa = Despesa.new(despesa_params)
    @despesa.ativo = true
    @despesa.data_inclusao = DateTime.now

    respond_to do |format|
      if @despesa.save

UPDATE "despesas" SET "data_alteracao" = ?, "data" = ?, "updated_at" = ? WHERE "despesas"."id" = ?  [["data_alteracao", "2018-04-26 00:25:41.791015"], ["data", "2018-04-19"], ["updated_at", "2018-04-26 00:25:41.806649"], ["id", 1]]
---
  def update
    @despesa.data_alteracao = DateTime.now
    old_valor = @despesa.valor
    respond_to do |format|
      if @despesa.update(despesa_params)

SELECT  "despesas".* FROM "despesas" WHERE "despesas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_despesa
      @despesa = Despesa.find(params[:id])