app/controllers/funcionarios_controller.rb

INSERT INTO "funcionarios" ("nome", "tel", "dias_autorizados", "ativo", "data_inclusao", "apartamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @funcionario = Funcionario.new(funcionario_params)
    @funcionario.ativo = true
    @funcionario.data_inclusao = DateTime.now

    respond_to do |format|
      if @funcionario.save

UPDATE "funcionarios" SET "data_alteracao" = ?, "updated_at" = ? WHERE "funcionarios"."id" = ?  [["data_alteracao", "2018-05-08 14:32:41.457203"], ["updated_at", "2018-05-08 14:32:41.459712"], ["id", 2]]
---
  def update
    @funcionario.data_alteracao = DateTime.now
    respond_to do |format|
      if @funcionario.update(funcionario_params)

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_funcionario
      @funcionario = Funcionario.find(params[:id])