app/controllers/moradors_controller.rb

INSERT INTO "moradors" ("nome", "rg", "cpf", "tel_residencial", "tel_celular", "tel_comercial", "ramal", "email", "parentesco", "tipo", "ativo", "data_inclusao", "apartamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @morador = Morador.new(morador_params)
    @morador.ativo = true
    @morador.data_inclusao = DateTime.now
    respond_to do |format|
      if @morador.save

UPDATE "moradors" SET "data_alteracao" = ?, "tel_celular" = ?, "updated_at" = ? WHERE "moradors"."id" = ?  [["data_alteracao", "2018-05-08 14:29:12.649930"], ["tel_celular", "123"], ["updated_at", "2018-05-08 14:29:12.653535"], ["id", 2]]
---
  def update
    @morador.data_alteracao = DateTime.now
    respond_to do |format|
      if @morador.update(morador_params)

UPDATE "moradors" SET "ativo" = ?, "data_alteracao" = ?, "updated_at" = ? WHERE "moradors"."id" = ?  [["ativo", "f"], ["data_alteracao", "2018-06-04 14:09:35.791801"], ["updated_at", "2018-06-04 14:09:35.819456"], ["id", 3]]
---
  def destroy
    #@morador.destroy
    @morador.ativo = !@morador.ativo
    @morador.data_alteracao = DateTime.now
    respond_to do |format|
      if @morador.update(@morador.attributes)

SELECT  "moradors".* FROM "moradors" WHERE "moradors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_morador
      @morador = Morador.find(params[:id])