app/controllers/receita_a_recebers_controller.rb

SELECT "receita_a_recebers".* FROM "receita_a_recebers"
---
  def index
    @receita_a_recebers = ReceitaAReceber.all

INSERT INTO "receita_a_recebers" ("valor", "data", "natureza", "ativo", "data_inclusao", "apartamento_id", "descricao_tipo_id", "morador_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @receita_a_receber = ReceitaAReceber.new(receita_a_receber_params)
    @receita_a_receber.ativo = true
    @receita_a_receber.data_inclusao = DateTime.now
    respond_to do |format|
      if @receita_a_receber.save

UPDATE "receita_a_recebers" SET "data_alteracao" = ?, "descricao_tipo_id" = ?, "updated_at" = ? WHERE "receita_a_recebers"."id" = ?  [["data_alteracao", "2018-04-26 00:07:06.644645"], ["descricao_tipo_id", 2], ["updated_at", "2018-04-26 00:07:06.702900"], ["id", 2]]
---
  def update
    @receita_a_receber.data_alteracao = DateTime.now
    respond_to do |format|
      if @receita_a_receber.update(receita_a_receber_params)

SELECT  "receita_a_recebers".* FROM "receita_a_recebers" WHERE "receita_a_recebers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_receita_a_receber
      @receita_a_receber = ReceitaAReceber.find(params[:id])