app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(login: params[:session][:login].downcase)
    if @user && @user.authenticate(params[:session][:password])
      sign_in(@user)
      @condominio = Condominio.all[0]
---
SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "admin"], ["LIMIT", 1]]
SELECT "condominios".* FROM "condominios"