app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "login", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]