app/controllers/veiculos_controller.rb

INSERT INTO "veiculos" ("marca", "modelo", "cor", "placa", "ativo", "data_inclusao", "apartamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @veiculo = Veiculo.new(veiculo_params)
    @veiculo.ativo = true
    @veiculo.data_inclusao = DateTime.now
    respond_to do |format|
      if @veiculo.save

UPDATE "veiculos" SET "data_alteracao" = ?, "updated_at" = ? WHERE "veiculos"."id" = ?  [["data_alteracao", "2018-05-08 14:33:34.386978"], ["updated_at", "2018-05-08 14:33:34.390100"], ["id", 2]]
---
  def update
    @veiculo.data_alteracao = DateTime.now
    respond_to do |format|
      if @veiculo.update(veiculo_params)

SELECT  "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_veiculo
      @veiculo = Veiculo.find(params[:id])